================================================================================
simple tuple
================================================================================

foo = [1, 2, "foo"]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (numeric_lit)
        (numeric_lit)
        (string_lit
          (template_literal))))))

================================================================================
multiline tuple
================================================================================

foo = [
  1,
  2,
  "foo"
]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (numeric_lit)
        (numeric_lit)
        (string_lit
          (template_literal))))))

================================================================================
empty tuple
================================================================================

foo = []

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple))))

================================================================================
multiline empty tuple
================================================================================

foo = [
]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple))))

================================================================================
object
================================================================================

foo = {1: 2, "foo"="bar"}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_elem
          (numeric_lit)
          (numeric_lit))
        (object_elem
          (string_lit
            (template_literal))
          (string_lit
            (template_literal)))))))

================================================================================
multiline object
================================================================================

foo = {
  1: 2,
  "foo"="bar"
}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_elem
          (numeric_lit)
          (numeric_lit))
        (object_elem
          (string_lit
            (template_literal))
          (string_lit
            (template_literal)))))))

================================================================================
empty object
================================================================================

foo = { }

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object))))

================================================================================
multiline empty object
================================================================================

foo = {
}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object))))

================================================================================
multiline object weird newlines
================================================================================

foo = { 1: 2,
  "foo"="bar"

}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_elem
          (numeric_lit)
          (numeric_lit))
        (object_elem
          (string_lit
            (template_literal))
          (string_lit
            (template_literal)))))))

================================================================================
complex object
================================================================================

foo = {
  a = "1",
  b = "2"
}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_elem
          (variable_expr
            (identifier))
          (string_lit
            (template_literal)))
        (object_elem
          (variable_expr
            (identifier))
          (string_lit
            (template_literal)))))))

================================================================================
complex from real world
================================================================================

worker_groups = [
    {
      name                          = "jasonb-test-group-1"
      instance_type                 = "t2.small"
      asg_desired_capacity          = 2
      additional_security_group_ids = [aws_security_group.external_connection.id]
    },
    {
      name                          = "jasonb-test-group-2"
      instance_type                 = "t2.medium"
      additional_security_group_ids = [aws_security_group.external_connection.id]
      asg_desired_capacity          = 1
    },
  ]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (object
          (object_elem
            (variable_expr
              (identifier))
            (string_lit
              (template_literal)))
          (object_elem
            (variable_expr
              (identifier))
            (string_lit
              (template_literal)))
          (object_elem
            (variable_expr
              (identifier))
            (numeric_lit))
          (object_elem
            (variable_expr
              (identifier))
            (tuple
              (get_attr_expr
                (get_attr_expr
                  (variable_expr
                    (identifier))
                  (identifier))
                (identifier)))))
        (object
          (object_elem
            (variable_expr
              (identifier))
            (string_lit
              (template_literal)))
          (object_elem
            (variable_expr
              (identifier))
            (string_lit
              (template_literal)))
          (object_elem
            (variable_expr
              (identifier))
            (tuple
              (get_attr_expr
                (get_attr_expr
                  (variable_expr
                    (identifier))
                  (identifier))
                (identifier))))
          (object_elem
            (variable_expr
              (identifier))
            (numeric_lit)))))))
