================================================================================
for tuple expression
================================================================================

foo = [for v in ["a", "b"]: v]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_expr
        (for_tuple_expr
          (identifier)
          (collection_value
            (tuple
              (literal_value
                (string_lit
                  (template_literal)))
              (literal_value
                (string_lit
                  (template_literal)))))
          (variable_expr
            (identifier)))))))

================================================================================
for tuple expression with index
================================================================================

foo = [for i, v in ["a", "b"]: i]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_expr
        (for_tuple_expr
          (identifier)
          (identifier)
          (collection_value
            (tuple
              (literal_value
                (string_lit
                  (template_literal)))
              (literal_value
                (string_lit
                  (template_literal)))))
          (variable_expr
            (identifier)))))))

================================================================================
for tuple expression with predicate
================================================================================

foo = [for i, v in ["a", "b", "c"]: v if pred(i)]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_expr
        (for_tuple_expr
          (identifier)
          (identifier)
          (collection_value
            (tuple
              (literal_value
                (string_lit
                  (template_literal)))
              (literal_value
                (string_lit
                  (template_literal)))
              (literal_value
                (string_lit
                  (template_literal)))))
          (variable_expr
            (identifier))
          (function_call
            (identifier)
            (variable_expr
              (identifier))))))))

================================================================================
for object expression
================================================================================

foo = {for i, v in ["a", "b"]: v => i}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_expr
        (for_object_expr
          (identifier)
          (identifier)
          (collection_value
            (tuple
              (literal_value
                (string_lit
                  (template_literal)))
              (literal_value
                (string_lit
                  (template_literal)))))
          (variable_expr
            (identifier))
          (variable_expr
            (identifier)))))))

================================================================================
for object expression 2
================================================================================

foo = {for i, v in ["a", "b"]: v => i...}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_expr
        (for_object_expr
          (identifier)
          (identifier)
          (collection_value
            (tuple
              (literal_value
                (string_lit
                  (template_literal)))
              (literal_value
                (string_lit
                  (template_literal)))))
          (variable_expr
            (identifier))
          (variable_expr
            (identifier))
          (ellipsis))))))
