================================================================================
nonary function call
================================================================================

foo = bar()

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (function_call
        (identifier)))))

================================================================================
unary function call
================================================================================

foo = bar("foo")

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (function_call
        (identifier)
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
variadic function call
================================================================================

foo = bar(x...)

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (function_call
        (identifier)
        (variable_expr
          (identifier))
        (ellipsis)))))

================================================================================
multiline function call
================================================================================

foo = bar(
  "a",
  "b",
  "c"
)

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (function_call
        (identifier)
        (literal_value
          (string_lit
            (template_literal)))
        (literal_value
          (string_lit
            (template_literal)))
        (literal_value
          (string_lit
            (template_literal)))))))
