================================================================================
unary operator -
================================================================================

foo = -3

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (unary_operation
        (numeric_lit)))))

================================================================================
unary operator !
================================================================================

foo = !true

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (unary_operation
        (bool_lit)))))

================================================================================
binary operators +
================================================================================

foo = 1+2

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (binary_operation
        (numeric_lit)
        (numeric_lit)))))

================================================================================
precedence in binary operators
================================================================================

foo = a != b && c == d

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (binary_operation
        (binary_operation
          (variable_expr
            (identifier))
          (variable_expr
            (identifier)))
        (binary_operation
          (variable_expr
            (identifier))
          (variable_expr
            (identifier)))))))
