================================================================================
simple quoted template expression
================================================================================

foo = "${ var.bar }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_interpolation
          (get_attr_expr
            (variable_expr
              (identifier))
            (identifier)))))))

================================================================================
empty template interpolation
================================================================================

foo = "${}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_interpolation)))))

================================================================================
template for expression in quoted template
================================================================================

foo = "%{ for a in b } prefix-${a} %{ endfor }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_for
          (identifier)
          (variable_expr
            (identifier))
          (template_literal)
          (template_interpolation
            (variable_expr
              (identifier))))))))

================================================================================
escaped template for directive
================================================================================

foo = "%{ for a in b } %%{ endfor } %{ endfor }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_for
          (identifier)
          (variable_expr
            (identifier))
          (template_literal))))))

================================================================================
escaped template for directive 2
================================================================================

foo = "%%{ for a in b } %%{ endfor }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (string_lit
        (template_literal)))))

================================================================================
template for directive with weird whitespace
================================================================================

foo = "%{     for a in b   } %{      endfor    }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_for
          (identifier)
          (variable_expr
            (identifier)))))))

================================================================================
template for expression in heredoc template
================================================================================

foo = <<EOF
%{ for a in b ~}

prefix-${a}

%{~ endfor }
EOF

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (template_for
          (identifier)
          (variable_expr
            (identifier))
          (template_literal)
          (template_interpolation
            (variable_expr
              (identifier))))))))

================================================================================
empty heredoc template
================================================================================

foo = <<END
END

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (template_literal)
        (MISSING _heredoc_identifier)))))

================================================================================
heredoc with fake ending
================================================================================

foo = <<END
  END    not!
END

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (template_literal)))))

================================================================================
quoted template expression with escaped strings and fake strip marker
================================================================================

foo = "${ " ~ " }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_interpolation
          (string_lit
            (template_literal)))))))

================================================================================
quoted template with nested quoted template
================================================================================

foo = "p-${ foo("v-${a.b}") }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_literal)
        (template_interpolation
          (function_call
            (identifier)
            (quoted_template
              (template_literal)
              (template_interpolation
                (get_attr_expr
                  (variable_expr
                    (identifier))
                  (identifier))))))))))

================================================================================
quoted template interpolation with strip markers
================================================================================

foo = "hello ${~ "world" ~} hello"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_literal)
        (template_interpolation
          (string_lit
            (template_literal)))
        (template_literal)))))

================================================================================
quoted template object expression in template
================================================================================

foo = "${ {a=b}[a] }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_interpolation
          (index_expr
            (object
              (object_elem
                (variable_expr
                  (identifier))
                (variable_expr
                  (identifier))))
            (variable_expr
              (identifier))))))))

================================================================================
escaped template interpolation start
================================================================================

foo = "hello $${ world"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (string_lit
        (template_literal)))))

================================================================================
tricky heredoc
================================================================================

foo = <<END
    contains fake endings
    END (ineligible) END
END

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (template_literal)))))

================================================================================
heredoc with identifier that does not fit into the serialization buffer (should not crash)
================================================================================

foo = <<XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (template_literal
          (MISSING _template_literal_chunk))))))

================================================================================
template if directive in quoted template
================================================================================

foo = "%{if cond} foo %{else} bar %{endif}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_if
          (variable_expr
            (identifier))
          (template_literal)
          (template_literal))))))

================================================================================
template nested for directives with interlaced chunks
================================================================================

foo = "%{for a in b} x %{for c in a} ${c} %{endfor} %{endfor}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_for
          (identifier)
          (variable_expr
            (identifier))
          (template_literal)
          (template_for
            (identifier)
            (variable_expr
              (identifier))
            (template_interpolation
              (variable_expr
                (identifier)))))))))

================================================================================
template nested if directives with interlaced chunks
================================================================================

foo = "%{if a} %{if b} y %{else} x %{endif} %{endif}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_if
          (variable_expr
            (identifier))
          (template_if
            (variable_expr
              (identifier))
            (template_literal)
            (template_literal)))))))

================================================================================
template empty if else statement
================================================================================

foo = "%{if a} %{else} %{endif}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_if
          (variable_expr
            (identifier)))))))

================================================================================
template empty for statement
================================================================================

foo = "%{for a in b} %{endfor}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (template_for
          (identifier)
          (variable_expr
            (identifier)))))))

================================================================================
template parenthesis in heredoc for directive with nested if 1
================================================================================

tpl6 = <<-EOF
  %{ for a in f(b) ~}
    ( %{~if a~} "true" %{~else~} "false" %{~endif~} )
  %{ endfor ~}
EOF

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (template_for
          (identifier)
          (function_call
            (identifier)
            (variable_expr
              (identifier)))
          (template_literal)
          (template_if
            (variable_expr
              (identifier))
            (template_literal)
            (template_literal))
          (template_literal))))))

================================================================================
template parenthesis in heredoc for directive with nested if 2
================================================================================

tpl6 = <<-EOF
  %{ for a in f(b) ~}
    ("foo")
    %{~if a~} "true" %{~else~} "false" %{~endif~}
  %{ endfor ~}
EOF

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (template_for
          (identifier)
          (function_call
            (identifier)
            (variable_expr
              (identifier)))
          (template_literal)
          (template_if
            (variable_expr
              (identifier))
            (template_literal)
            (template_literal)))))))
